src/InformationRegisters/СотрудникиСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Сотрудник является клиентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>APIВес</Name>
					<Comment>Вес сотрудника для API, сначала выводятся более тяжелые</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность сотрудника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОМС</Name>
					<Comment>Код по ОМС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинОнЛайнКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДляСайтаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольОнЛайнКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДляОнлайнЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольПользователя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПользовательИБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпецилазацииСотрудника</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Comment>Специализация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Comment>Основная специализация</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеКассы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Касса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСтруктурныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСтруктурныеЕдиницыЖурналаЗаписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/СотрудникиСегмента/Ext/ManagerModule.bsl
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Вернуть массив номеров сотрудников по сегменту
//
// Параметры:
//  Сегмент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьМассивНомеровСотрудниковПоСегменту(Сегмент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиСегмента.Сотрудник КАК Получатель,
		|	СотрудникиКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	РегистрСведений.СотрудникиСегмента КАК СотрудникиСегмента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
		|		ПО СотрудникиСегмента.Сотрудник = СотрудникиКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	СотрудникиСегмента.Сегмент = &Сегмент
		|	И СотрудникиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКлиента)
		|	И СотрудникиКонтактнаяИнформация.НомерТелефона <> """"
		|	И НЕ СотрудникиКонтактнаяИнформация.Ссылка.ЭтоГруппа";

	Запрос.УстановитьПараметр("Сегмент", Сегмент);	
		
	Таблица = Запрос.Выполнить().Выгрузить();
	МассивПолучателей 		= Таблица.ВыгрузитьКолонку("Получатель");
	МассивНомеровТелефонов 	= Таблица.ВыгрузитьКолонку("НомерТелефона");
	МассивНомеровИПолучателей = Новый Массив(2);
	МассивНомеровИПолучателей[0] = МассивПолучателей;
	МассивНомеровИПолучателей[1] = МассивНомеровТелефонов;
	Возврат МассивНомеровИПолучателей;
	
КонецФункции

// Процедура - Добавить сотрудника в сегмент
//
// Параметры:
//  Сегмент		 - 	 - 
//  Сотрудник	 - 	 - 
//
Процедура ДобавитьСотрудникаВСегмент(Сегмент, Сотрудник) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Сегмент) ИЛИ НЕ ЗначениеЗаполнено(Сотрудник) Тогда 
		Возврат;
	КонецЕсли;	
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	НаборЗаписейСегмента 		= СоздатьНаборЗаписей();
	НаборЗаписейСегмента.Отбор.Сегмент.Установить(Сегмент);
	НаборЗаписейСегмента.Отбор.Сотрудник.Установить(Сотрудник);
	
	ЗаписьСегмента 				= НаборЗаписейСегмента.Добавить();
	ЗаписьСегмента.Сегмент 		= Сегмент;
	ЗаписьСегмента.Сотрудник 	= Сотрудник;
	
	НаборЗаписейСегмента.ОбменДанными.Загрузка = Истина;
	Попытка
		НаборЗаписейСегмента.Записать();
	Исключение
		
	КонецПопытки;	
	
КонецПроцедуры

// Процедура - Удалить сотрудника из сегмента
//
// Параметры:
//  Сегмент		 - 	 - 
//  Сотрудник	 - 	 - 
//
Процедура УдалитьСотрудникаИзСегмента(Сегмент, Сотрудник) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Сегмент) ИЛИ НЕ ЗначениеЗаполнено(Сотрудник) Тогда 
		Возврат;
	КонецЕсли;	
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	НаборЗаписейСегмента = СоздатьНаборЗаписей();
	НаборЗаписейСегмента.Отбор.Сегмент.Установить(Сегмент);
	НаборЗаписейСегмента.Отбор.Сотрудник.Установить(Сотрудник);
	НаборЗаписейСегмента.ОбменДанными.Загрузка = Истина;
	Попытка
		НаборЗаписейСегмента.Записать();
	Исключение
		
	КонецПопытки;	
		
КонецПроцедуры	

// Функция, возвращает сегменты, содержащие сотрудника.
//
Функция ПолучитьСегментыСотрудника(Сотрудник) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СотрудникиСегмента.Сегмент КАК Сегмент
	|ИЗ
	|	РегистрСведений.СотрудникиСегмента КАК СотрудникиСегмента
	|ГДЕ
	|	СотрудникиСегмента.Сотрудник = &Сотрудник
	|	И НЕ СотрудникиСегмента.Сегмент.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сегмент");
	
КонецФункции

// Функция - Получить сотрудников сегмента
//
// Параметры:
//  СегментСотрудников	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСотрудниковСегмента(СегментСотрудников) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СегментСотрудников", СегментСотрудников);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СотрудникиСегмента.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.СотрудникиСегмента КАК СотрудникиСегмента
	|ГДЕ
	|	СотрудникиСегмента.Сегмент = &СегментСотрудников
	|	И СотрудникиСегмента.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции

#КонецОбласти

#КонецЕсли
